InskalBTHBPPT/Ship_Model_Control_ESP32-S3-v2026.01/PlatformIO/ESP-Now_ESP32-S3_Remote-Side-01/src/main.cpp
  // Clamp hasil ke range valid (double check)
  if (duty < 205) duty = 205;  // Min duty untuk 1000 Âµs
  if (duty > 410) duty = 410;  // Max duty untuk 2000 Âµs
  
  return duty;
}

/**
 * @brief Mode Manual - Kontrol rudder langsung dari receiver RC (CH1)
 */
void rudder_manual() {
  servo_angle_current_offset = mapFloat(controlInput.rudder, 1000, 1992, -40.0f, 40.0f);
  servo_angle_current_offset = constrain(servo_angle_current_offset, -40.0f, 40.0f);

  float calculated_angle = REFERENCE_ANGLE + servo_angle_current_offset;
  servo_duty = angleToDuty(calculated_angle);
  ledcWrite(SERVO_RUDDER_pin, servo_duty);
}

void rudder_hold_neutral() {
  servo_angle_current_offset = 0.0f;
  servo_duty = angleToDuty(REFERENCE_ANGLE);
  ledcWrite(SERVO_RUDDER_pin, servo_duty);
}

void auto_track() {
  // TODO: navigasi waypoint - implementasi nanti
  rudder_hold_neutral();
}

void check_mode_auto_manual(uint16_t modeautomanual) {
  if (modeautomanual >= 1750) {
    auto_track();
    dataToSend.mode_auto = 1;
  } else {
    rudder_manual();
    dataToSend.mode_auto = 0;
  }
}

/**
 * @brief Setup function - Inisialisasi semua hardware dan komunikasi
 * 
 * @details
 * Function ini melakukan inisialisasi:
 * 1. Serial Monitor (115200 baud)
 * 2. PPM interrupt handler untuk receiver RC
 * 3. Pulse counter interrupt untuk rotary encoder
 * 4. ADC configuration untuk feedback dan battery monitoring
 * 5. Servo PWM configuration (rudder, propeller speed/direction)
 * 6. GNSS module (u-blox GPS) via Serial1
 * 7. IMU (HWT905TTL) via Serial2
 * 8. ESP-NOW untuk wireless communication
 * 
 * @note
 * - Semua interrupt handler harus dideklarasikan dengan IRAM_ATTR
 * - ADC2 tidak dapat digunakan saat WiFi aktif (gunakan ADC1 saja)
 * - GNSS akan dikonfigurasi ke 115200 baud dan 10 Hz update rate
 */
void setup() {
    // ========== Serial Monitor Initialization ==========
    Serial.begin(115200);
    delay(500);
    
    // ========== PPM Interrupt Setup ==========
    pinMode(PPM_PIN, INPUT);
    attachInterrupt(digitalPinToInterrupt(PPM_PIN), ppm_interrupt_handler, CHANGE);
    
    // Setup Pulse Counter for Motor Prop 1
    pinMode(PULSE_PIN_Motor_prop_1, INPUT);
    attachInterrupt(digitalPinToInterrupt(PULSE_PIN_Motor_prop_1), pulse_interrupt_handler_motor_prop_1, RISING);
    
    // Setup Pulse Counter for Motor Prop 2
    pinMode(PULSE_PIN_Motor_prop_2, INPUT);
    attachInterrupt(digitalPinToInterrupt(PULSE_PIN_Motor_prop_2), pulse_interrupt_handler_motor_prop_2, RISING);
    
    // Configure ADC settings
    analogReadResolution(12);     

    bool attach_PWM_pin = ledcAttachChannel(SERVO_RUDDER_pin, SERVO_RUDDER_freq, SERVO_RUDDER_resolution, 0);
    if (attach_PWM_pin) {
      Serial.println("Servo Rudder attached to pin 5");
    } else {
      Serial.println("Failed to attach servo rudder");
    }

    // Setup LEDC untuk Propeller Speed
    bool attach_prop_speed = ledcAttachChannel(PROP_SPEED_pin, PROP_SPEED_freq, PROP_SPEED_resolution, 2);
    if (attach_prop_speed) {
      Serial.println("Propeller Speed attached to pin 6 (LEDC)");
    } else {
      Serial.println("Failed to attach propeller speed");
    }

    // Setup LEDC untuk Propeller Direction
    bool attach_prop_dir = ledcAttachChannel(PROP_DIRECTION_pin, PROP_DIRECTION_freq, PROP_DIRECTION_resolution, 1);
    if (attach_prop_dir) {
      Serial.println("Propeller Direction attached to pin 7 (LEDC)");
    } else {
      Serial.println("Failed to attach propeller direction");
    }
    // Note: servoPropSpeed dan servoPropDirection tidak digunakan lagi, sudah diganti dengan LEDC

    delay(1000);
    Serial.println("PPM Reader initialized - Reading FS-iA6B on pin 4");

      // Start Serial 2 with the defined RX and TX pins and a baud rate of 9600
    gpsSerial.begin(GPS_BAUD, SERIAL_8N1, RXD1, TXD1);
    Serial.println("Serial 2 started at 9600 baud rate");

    // 1) Set u-blox UART1 baud to 115200 at current link speed (9600)
    delay(200);
    setUbxUartBaud(115200);
    delay(200);
    // 2) Switch ESP32 UART to 115200 to match the module
  #if ARDUINO_USB_CDC_ON_BOOT
    // ensure buffered data is flushed before changing baud
  #endif
    gpsSerial.flush();
    // Prefer updateBaudRate if available; fallback to end/begin
  #if defined(HW_SERIAL_HAS_UPDATEBAUDRATE)
    gpsSerial.updateBaudRate(115200);
  #else
    gpsSerial.end();
    delay(50);
    gpsSerial.begin(115200, SERIAL_8N1, RXD1, TXD1);
  #endif
    Serial.println("GPS UART switched to 115200");

    // 3) Now set 10 Hz update rate at the new baud
    delay(200);
    setUbxMeasurementRate(100); // 100 ms = 10 Hz

    // 4) Persist configuration to BBR and Flash (if supported)
    delay(200);
    saveUbxConfig(true, true);

    // setting for hwt905ttl serial port
    HWT905TTL_Serial.begin(HWT905TTL_BAUD, SERIAL_8N1, RXD2, TXD2);

        // Set device as a Wi-Fi Station
    WiFi.mode(WIFI_STA);

    // Init ESP-NOW
    if (esp_now_init() != ESP_OK) {
      Serial.println("Error initializing ESP-NOW");
      return;
    }

    // Once ESPNow is successfully Init, we will register for Send CB to
    // get the status of Trasnmitted packet
    // esp_now_register_send_cb(OnDataSent);
    
    // Register peer
    memcpy(peerInfo.peer_addr, user_side_Address, 6);
    peerInfo.channel = 0;  
    peerInfo.encrypt = false;
    
    // Add peer        
    if (esp_now_add_peer(&peerInfo) != ESP_OK){
      Serial.println("Failed to add peer");
      return;
    }
}

/**
 * @brief Loop function - Main program loop
 * 
 * @details
 * Function ini berjalan terus menerus dan melakukan:
 * 1. Membaca data dari GNSS module (Serial1)
 * 2. Membaca data dari IMU (Serial2)
 * 3. Setiap 100ms (10 Hz):
 *    - Update data GPS (latitude, longitude, speed)
 *    - Update data IMU (yaw, accel, gyro)
 *    - Map PPM values ke range 1000-2000
 *    - Check mode auto/manual dan eksekusi fungsi kontrol
 *    - Baca feedback servo dari ADC
 *    - Kontrol motor propeller (speed dan direction)
 *    - Hitung RPM dari rotary encoder
 *    - Baca tegangan baterai
 *    - Kirim data via ESP-NOW
 * 
 * @note
 * - Update rate: 10 Hz (setiap 100ms)
 * - Semua data dikirim dalam format fixed-point (Ã— 100)
 * - Struktur data harus sama dengan receiver
 */
void loop() {
    unsigned long currentMillis = millis();
    
    // ========== Read GNSS Data ==========
    // Parse data GPS dari Serial1 (non-blocking)
    while (gpsSerial.available() > 0) {
      gps.encode(gpsSerial.read());
    }

    // ========== Read IMU Data ==========
    // Parse data IMU dari Serial2 (non-blocking)
    while (HWT905TTL_Serial.available()) 
    {
      JY901.CopeSerialData(HWT905TTL_Serial.read()); // Call JY901 data cope function
    }

    // ========== Main Loop - Run setiap 100ms (10 Hz) ==========
    if (currentMillis - previousMillis >= intervaltime) {
        // Serial.print(currentMillis);
        // Serial.print(" ");
        previousMillis = currentMillis;
        dataToSend.timestamp = (double)currentMillis / 1000.0;

        // Snapshot to struct every interval, regardless of isUpdated()
        latestGpsData.latitude = gps.location.lat();
        latestGpsData.longitude = gps.location.lng();
        latestGpsData.speedMps = gps.speed.mps();

        // latestGpsData.locationValid = gps.location.isValid();
        // latestGpsData.timeValid = gps.time.isValid();
        // latestGpsData.locationAgeMs = gps.location.age();
        // latestGpsData.timeAgeMs = gps.time.age();
        // latestGpsData.altitudeM = gps.altitude.meters();
        // latestGpsData.hdop = gps.hdop.value() / 100.0;
        // latestGpsData.satellites = gps.satellites.value();
        // if (latestGpsData.locationValid) {
        // }
        dataToSend.latitude = latestGpsData.latitude;
        dataToSend.longitude = latestGpsData.longitude;
        // Konversi speedMps ke uint16_t (Ã— 100)
        dataToSend.speedMps = (uint16_t)(latestGpsData.speedMps * 100);

        // IMU JY901: yaw, accel (g), gyro (deg/s)
        float rawYaw = (float)JY901.stcAngle.Angle[2]/32768*180;
        
        // Modifikasi: jika yaw < 0, jadikan 360 + yaw
        float yaw;
        if (rawYaw < 0) {
          yaw = 360.0 + rawYaw;
        } else {
          yaw = rawYaw;
        }
        
        dataToSend.yaw = (uint16_t)(yaw * 100);

        // Accel (g) dan gyro (deg/s) dari IMU JY901 — fixed-point x100
        dataToSend.accel_x = (int16_t)((JY901.stcAcc.a[0] / 32768.0f * 16.0f) * 100.0f);
        dataToSend.accel_y = (int16_t)((JY901.stcAcc.a[1] / 32768.0f * 16.0f) * 100.0f);
        dataToSend.accel_z = (int16_t)((JY901.stcAcc.a[2] / 32768.0f * 16.0f) * 100.0f);
        dataToSend.gyro_x = (int16_t)((JY901.stcGyro.w[0] / 32768.0f * 2000.0f) * 100.0f);
        dataToSend.gyro_y = (int16_t)((JY901.stcGyro.w[1] / 32768.0f * 2000.0f) * 100.0f);
        dataToSend.gyro_z = (int16_t)((JY901.stcGyro.w[2] / 32768.0f * 2000.0f) * 100.0f);
        
        for (uint8_t i = 0; i < CHANNEL_COUNT; i++) {
            // Convert raw PPM FS-iA6B values (600-1600) to standard servo range (1000-2000)
            ppm_mapped[i] = map(ppm_values[i], PPM_MIN_CHANNEL_VALUE, PPM_MAX_CHANNEL_VALUE, 1000, 2000);
        }
        
        controlInput.mode_auto_manual = ppm_mapped[5];  // CH6
        controlInput.rudder = ppm_mapped[0];            // CH1

        check_mode_auto_manual(controlInput.mode_auto_manual);

        
        // Read analog values of servo potensiometer output in millivolts
        uint32_t adc_millivolts_servo_1 = analogReadMilliVolts(ADC_PIN_SERVO_1);
        uint32_t adc_millivolts_servo_2 = analogReadMilliVolts(ADC_PIN_SERVO_2);
  
        float Calc_deg_servo_1 = adc_millivolts_servo_1 * 0.0595 - 98.848;
        float Calc_deg_servo_2 = adc_millivolts_servo_2 * 0.0594 - 98.801;

        // Set PWM for PropSpeed dan PropDirection
        controlInput.propSpeed = ppm_mapped[2];           // CH3
        controlInput.propDirection = ppm_mapped[4];       // CH5
        
        // Generate PWM for PropSpeed (menggunakan LEDC)
        // Konversi microseconds ke duty cycle menggunakan fungsi yang sama
        uint32_t prop_speed_duty = microsecondsToDuty(controlInput.propSpeed);
        // Generate PWM menggunakan LEDC
        bool write_result_prop_speed = ledcWrite(PROP_SPEED_pin, prop_speed_duty);
        
        // Generate PWM for PropDirection (menggunakan LEDC)
        // Konversi microseconds ke duty cycle menggunakan fungsi yang sama
        uint32_t prop_dir_duty = microsecondsToDuty(controlInput.propDirection);
        // Generate PWM menggunakan LEDC
        bool write_result_prop_dir = ledcWrite(PROP_DIRECTION_pin, prop_dir_duty); 

